microsoft/uf2-samdx1/lib/samd21/samd21b/atdf/ATSAMD21E16BU.atdf
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x42001000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA08"/>
              <signal group="PAD" index="1" function="D" pad="PA09"/>
              <signal group="PAD" index="2" function="D" pad="PA10"/>
              <signal group="PAD" index="2" function="C" pad="PA14"/>
              <signal group="PAD" index="3" function="D" pad="PA11"/>
              <signal group="PAD" index="3" function="C" pad="PA15"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="5"/>
              <param name="DMAC_ID_TX" value="6"/>
              <param name="GCLK_ID_CORE" value="22"/>
              <param name="GCLK_ID_SLOW" value="19"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="68"/>
            </parameters>
          </instance>
          <instance name="SERCOM3">
            <register-group name="SERCOM3" name-in-module="SERCOM" address-space="base" offset="0x42001400"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA16"/>
              <signal group="PAD" index="0" function="C" pad="PA22"/>
              <signal group="PAD" index="1" function="D" pad="PA17"/>
              <signal group="PAD" index="1" function="C" pad="PA23"/>
              <signal group="PAD" index="2" function="D" pad="PA18"/>
              <signal group="PAD" index="2" function="C" pad="PA24"/>
              <signal group="PAD" index="3" function="D" pad="PA19"/>
              <signal group="PAD" index="3" function="C" pad="PA25"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="7"/>
              <param name="DMAC_ID_TX" value="8"/>
              <param name="GCLK_ID_CORE" value="23"/>
              <param name="GCLK_ID_SLOW" value="19"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="69"/>
            </parameters>
          </instance>
        </module>
        <module name="SYSCTRL" id="U2100" version="2.0.1">
          <instance name="SYSCTRL">
            <register-group name="SYSCTRL" name-in-module="SYSCTRL" address-space="base" offset="0x40000800"/>
            <signals>
              <signal group="XIN" function="XIN" pad="PA14"/>
              <signal group="XIN32" function="XIN32" pad="PA00"/>
              <signal group="XOUT" function="XOUT" pad="PA15"/>
              <signal group="XOUT32" function="XOUT32" pad="PA01"/>
            </signals>
            <parameters>
              <param name="BGAP_CALIB_MSB" value="11"/>
              <param name="BOD33_CALIB_MSB" value="5"/>
              <param name="DFLL48M_COARSE_MSB" value="5"/>
              <param name="DFLL48M_FINE_MSB" value="9"/>
              <param name="GCLK_ID_DFLL48" value="0"/>
              <param name="GCLK_ID_FDPLL" value="1"/>
              <param name="GCLK_ID_FDPLL32K" value="2"/>
              <param name="OSC32K_COARSE_CALIB_MSB" value="6"/>
              <param name="POR33_ENTEST_MSB" value="1"/>
              <param name="SYSTEM_CLOCK" value="1000000"/>
              <param name="ULPVREF_DIVLEV_MSB" value="3"/>
              <param name="ULPVREG_FORCEGAIN_MSB" value="1"/>
              <param name="ULPVREG_RAMREFSEL_MSB" value="2"/>
              <param name="VREF_CONTROL_MSB" value="48"/>
              <param name="VREF_STATUS_MSB" value="7"/>
              <param name="VREG_LEVEL_MSB" value="2"/>
              <param name="BOD12_VERSION" value="0x112"/>
              <param name="BOD33_VERSION" value="0x112"/>
              <param name="DFLL48M_VERSION" value="0x301"/>
              <param name="FDPLL_VERSION" value="0x111"/>
              <param name="OSCULP32K_VERSION" value="0x111"/>
              <param name="OSC8M_VERSION" value="0x120"/>
              <param name="OSC32K_VERSION" value="0x112"/>
              <param name="VREF_VERSION" value="0x201"/>
              <param name="VREG_VERSION" value="0x201"/>
              <param name="XOSC_VERSION" value="0x114"/>
              <param name="XOSC32K_VERSION" value="0x113"/>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="U2212" version="1.3.1">
          <instance name="TC3">
            <register-group name="TC3" name-in-module="TC" address-space="base" offset="0x42002C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA18"/>
              <signal group="WO" index="0" function="E" pad="PA14"/>
              <signal group="WO" index="1" function="E" pad="PA19"/>
              <signal group="WO" index="1" function="E" pad="PA15"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="DMAC_ID_OVF" value="24"/>
              <param name="GCLK_ID" value="27"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="75"/>
            </parameters>
          </instance>
          <instance name="TC4">
            <register-group name="TC4" name-in-module="TC" address-space="base" offset="0x42003000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA22"/>
              <signal group="WO" index="1" function="E" pad="PA23"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="DMAC_ID_OVF" value="27"/>
              <param name="GCLK_ID" value="28"/>
              <param name="MASTER" value="1"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="76"/>
            </parameters>
          </instance>
          <instance name="TC5">
            <register-group name="TC5" name-in-module="TC" address-space="base" offset="0x42003400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA24"/>
              <signal group="WO" index="1" function="E" pad="PA25"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="DMAC_ID_OVF" value="30"/>
              <param name="GCLK_ID" value="28"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="77"/>
            </parameters>
          </instance>
        </module>
